# Просим пользователя ввести 3 числа
a = int(input('Введите целое число а: '))
b = int(input('Введите целое число b: '))
c = int(input('Введите целое число c: '))
# Вычисляем является ли средним из них а и выводим да при положительном результате
if b<a<c or c<a<b:
    print ('Среднее число а: ', a)
# Вычисляем является ли средним из них b и выводим да при положительном результате
elif a<b<c or c<b<a:
    print('Среднее число b: ', b)
# Вычисляем является ли средним из них c и выводим да при положительном результате
else:
    print('Среднее число c: ', c)

#
